app/views/profiles/_form.html.erb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 35 LIMIT 1
---
  <div class="form-actions">
  <%pvalue=Profile.find_by_user_id(current_user.user_id)%>