app/views/users/_user.html.erb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 16 LIMIT 1
---
        <td><%= user.user_email %></td>
        <%pvalue=Profile.find_by_user_id(user.user_id)%>