app/views/items/_form.html.erb

SELECT "categories".* FROM "categories"
---
      <%#= f.text_field :category_id, :class => 'text_field' %>
      <%@categories = Category.all%>