app/controllers/items_controller.rb

  def index

    @categories = Category.all
    if !params[:filter].nil? && params[:filter]=="yes"
       item = Item.where("category_id=?",params[:category_id]).order("name asc")
       @items= item.paginate(:page => params[:page], :per_page => 3)
---
SELECT "categories".* FROM "categories"
SELECT "items".* FROM "items" ORDER BY name asc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "items"

  def create
    @item = Item.new(item_params.merge(:user_id => current_user.user_id))

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("available", "avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "category_id", "created_at", "discount", "discription", "name", "price", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

def purchase
 @item = Item.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", "12"]]

def purchase_option
      @item = Item.find(params[:item][:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", "12"]]

        if response.success?
          p "^^^^^^^^^^"
          @order=Order.new
          @order.item_id=@item.id,
          @order.created_user_id=@item.user_id,
          @order.purchased_user_id=current_user.user_id,
          @order.first_name=params[:item][:first_name],
          @order.last_name=params[:item][:last_name],
          @order.card_type=params[:item][:card_type],
          @order.card_number="#{params[:item][:cardnumber_1]}" + "#{params[:item][:cardnumber_2]}" + "#{params[:item][:cardnumber_3]}" + "#{params[:item][:cardnumber_4]}",
          @order.card_verification=params[:item][:cardnumber_5],
          @order.address=params[:item][:address],
          @order.city=params[:item][:city],
          @order.state=params[:item][:state],
          @order.country=params[:item][:country],
          @order.zipcode=params[:item][:zipcode],
          @order.phone=params[:item][:phone_no],
          @order.save!
          if @order.save
            p @item.available
            p "**********************************"
            @user_credit = UserCredit.new(:created_user_id => @item.user_id, :purchased_user_id => current_user.user_id, :item_id => @item.id, :credit_amount => earn_own, :admin_credit_amount => earn_admin)
            @user_credit.save
---
INSERT INTO "orders" ("address", "card_number", "card_type", "card_verification", "city", "country", "created_at", "created_user_id", "first_name", "last_name", "phone", "purchased_user_id", "state", "updated_at", "zipcode") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
UPDATE "items" SET "available" = $1, "updated_at" = $2 WHERE "items"."id" = 12  [["available", 0], ["updated_at", Sat, 31 Jan 2015 05:39:36 UTC +00:00]]
INSERT INTO "user_credits" ("admin_credit_amount", "created_at", "created_user_id", "credit_amount", "item_id", "purchased_user_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def category_filter
    if !params[:filter].nil? && params[:filter]=="yes"
       if !params[:category_id].nil? && params[:category_id]=="all"
          @items = Item.all.order("name asc")
---
SELECT "items".* FROM "items" WHERE (category_id='1') ORDER BY name asc