app/controllers/profiles_controller.rb

  def update
    respond_to do |format|
      if @profile.update(profile_params)
---
UPDATE "profiles" SET "address" = $1, "city" = $2, "state" = $3, "country" = $4, "mobile" = $5, "avatar_file_name" = $6, "avatar_content_type" = $7, "avatar_file_size" = $8, "avatar_updated_at" = $9, "date_of_birth" = $10, "updated_at" = $11 WHERE "profiles"."id" = 24