app/controllers/users_controller.rb

  def index
    if !current_user.nil? && !admin.nil? && current_user.present? && admin.present?
      @users = User.all.paginate(:page => params[:page], :per_page => 5)
---
SELECT "users".* FROM "users" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "users"

  def loginuser
    @user=User.where("user_email=? AND password=?",params[:user][:user_email],params[:user][:password]).last
---
SELECT "users".* FROM "users" WHERE (user_email='kabidaya@gmail.com' AND password='daya1234' and) ORDER BY "users"."user_id" DESC LIMIT 1

  def create
    @user = User.new(user_params.merge(:user_type => false))
    respond_to do |format|
      if @user.save
        @profile = Profile.create!(user_id:@user.user_id)
---
INSERT INTO "users" ("created_at", "password", "updated_at", "user_email", "user_name") VALUES ($1, $2, $3, $4, $5) RETURNING "user_id"  [["created_at", Sat, 31 Jan 2015 05:37:07 UTC +00:00], ["password", "password"], ["updated_at", Sat, 31 Jan 2015 05:37:07 UTC +00:00], ["user_email", "p.selvam@gmail.com"], ["user_name", "aaaa"]]
INSERT INTO "profiles" ("created_at", "updated_at", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Sat, 31 Jan 2015 05:37:07 UTC +00:00], ["updated_at", Sat, 31 Jan 2015 05:37:07 UTC +00:00], ["user_id", 20]]

  def destroy
    # @user.profile.destroy
    @user.destroy
---
DELETE FROM "users" WHERE "users"."user_id" = $1  [["user_id", 31]]

    def set_user
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."user_id" = $1 LIMIT 1  [["user_id", "31"]]