app/controllers/user_credits_controller.rb

  def index
    @user_credits = UserCredit.all
    @users=User.all
---
SELECT "user_credits".* FROM "user_credits" WHERE (created_user_id=19)
SELECT "users".* FROM "users"