app/views/user_credits/index.html.erb

<%if !current_user.nil? && !admin.nil? && current_user.user_email==admin.user_email%>
<%own=UserCredit.where("created_user_id=?",current_user.user_id).map(&:credit_amount)  %>
<%admin.inspect%>
<%foradmin=UserCredit.all.map(&:admin_credit_amount)  %>
---
SELECT "user_credits".* FROM "user_credits" WHERE (created_user_id=19)
SELECT "user_credits".* FROM "user_credits"